app/controllers/posts_controller.rb

    def create
        # Never do below....long way of doing it.
        Post.create(title: params[:post][:title], description: params[:post][:description])
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2019-01-14 06:09:51.610626"], ["updated_at", "2019-01-14 06:09:51.610626"]]